# 25. Pandas Basic

- [Pandas Tutorial](https://pandas.pydata.org/getting_started.html)

## Pandas 는 Series data type 과 DataFrame data type 으로 구성된다.

### Series (1 차원) : numpy array 와 유사. 
- 차이점 - numpy 와 달리 Series 는 axis (행, 열)에 label 을 부여할 수 있다. 즉, numpy 와 같이 숫자로만 indexing 하는 것이 아니라 label 명으로 indexing 을 할 수 있다. 또한 숫자 뿐 아니라 임의의 Python object 를 모두 element 로 가질 수 있다.

### DataFrame (2차원, table)
- Python program 안의 Excel

### Series vs DataFrame
<img src="series-and-dataframe.width-1200.png" width="400">

<img src="base_01_pandas_5_0.png" width="400">

In [43]:
import pandas as pd
import numpy as np

## DataFrame 만들기

DataFrame 은 여러개의 Series 를 같은 index 기준으로 모아 Table 을 만든 것이다.

### List  이용

In [44]:
np.random.seed(101)
data = np.random.randn(5, 4)

In [45]:
df = pd.DataFrame(data, index=['A', 'B', 'C', 'D', 'E'], columns=['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Dictionary 이용

In [46]:
songs = {"book": ["춘향전", "무기여 잘있거라", "소나기", "해리포터", "왕좌의 게임", "알고리즘파이썬"],
               "year": [1600, 1930, 1940, 1990, 2000, 2010],
               "pages": [50, 100, 100, 1000, 2000, 300]}

songs_df = pd.DataFrame(songs)
songs_df

       book  year  pages
0       춘향전  1600     50
1  무기여 잘있거라  1930    100
2       소나기  1940    100
3      해리포터  1990   1000
4    왕좌의 게임  2000   2000
5   알고리즘파이썬  2010    300

- page 가 많은 순서로 sort

In [129]:
songs_df.sort_values('pages', ascending=False, inplace=True)
songs_df

       book  year  pages
4    왕좌의 게임  2000   2000
3      해리포터  1990   1000
5   알고리즘파이썬  2010    300
1  무기여 잘있거라  1930    100
2       소나기  1940    100
0       춘향전  1600     50

### DataFrame indexing

- single column

In [47]:
songs_df['pages']

0      50
1     100
2     100
3    1000
4    2000
5     300
Name: pages, dtype: int64

In [48]:
type(songs_df['pages'])

pandas.core.series.Series

- multiple columns

In [49]:
y = songs_df[['book', 'year']]
y

       book  year
0       춘향전  1600
1  무기여 잘있거라  1930
2       소나기  1940
3      해리포터  1990
4    왕좌의 게임  2000
5   알고리즘파이썬  2010

## slicing of DataFrame

In [50]:
df[:3]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [51]:
df['A':'B']

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

### loc

In [52]:
df.loc['B':'C', ['W', 'X']]

          W         X
B  0.651118 -0.319318
C -2.018168  0.740122

### iloc

In [53]:
df.iloc[1:3, 0:2]

          W         X
B  0.651118 -0.319318
C -2.018168  0.740122

In [54]:
df.iloc[1:3, :]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [55]:
df.iloc[1,1]

-0.31931804459303326

### 조건에 따른 slicing

In [56]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df[(df['W'] > 0) | (df['Y'] > 0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### index values

In [58]:
df.index.values

array(['A', 'B', 'C', 'D', 'E'], dtype=object)

### dataframe 의 column 명

In [59]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

### column 별 unique value 의 갯수

In [60]:
df.nunique()

W    5
X    5
Y    5
Z    5
dtype: int64

In [61]:
df['W'].unique()

array([ 2.70684984,  0.65111795, -2.01816824,  0.18869531,  0.19079432])

In [62]:
df['W'].value_counts()

 0.651118    1
 0.190794    1
 2.706850    1
 0.188695    1
-2.018168    1
Name: W, dtype: int64

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 360.0+ bytes

In [64]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

### new column 추가/삭제

In [65]:
df['new'] = df['W'] + df['X']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [66]:
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [67]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [68]:
df.drop('new', axis=1, inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
df.drop('D', axis=0, inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df.shape

(4, 4)

In [71]:
df.loc['A':'B', ['Y']] = np.nan
df

          W         X         Y         Z
A  2.706850  0.628133       NaN  0.503826
B  0.651118 -0.319318       NaN  0.605965
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

### missing value 를 포함하고 있는 모든 row 삭제 - default

In [72]:
df.dropna()

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

### missing value 를 포함하고 있는 모든 column 삭제

In [73]:
df.dropna(axis=1)

          W         X         Z
A  2.706850  0.628133  0.503826
B  0.651118 -0.319318  0.605965
C -2.018168  0.740122 -0.589001
E  0.190794  1.978757  0.683509

### missing value 대체

In [74]:
df.fillna(value=0)

          W         X         Y         Z
A  2.706850  0.628133  0.000000  0.503826
B  0.651118 -0.319318  0.000000  0.605965
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df.fillna(value=df['Y'].mean())

          W         X         Y         Z
A  2.706850  0.628133  1.567390  0.503826
B  0.651118 -0.319318  1.567390  0.605965
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

### csv file read

In [76]:
df = pd.read_csv("winequality-red.csv", sep=";")
df.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

### DataFrame 을 csv file 로 write

In [77]:
df2 = df.loc[:, ['quality', 'alcohol', 'pH']]
df2.to_csv('winequality-2.csv')

In [78]:
pd.read_csv('winequality-2.csv', index_col=0).head()

   quality  alcohol    pH
0        5      9.4  3.51
1        5      9.8  3.20
2        5      9.8  3.26
3        6      9.8  3.16
4        5      9.4  3.51

### df.apply + lambda

In [79]:
df["New_val"] = df.apply(lambda x : 
                         x["fixed acidity"] + x["citric acid"] , axis = 1 )
df

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality,New_val
0,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5,7.40
1,7.8,0.880,0.00,2.6,0.098,25.0,67.0,0.99680,3.20,0.68,9.8,5,7.80
2,7.8,0.760,0.04,2.3,0.092,15.0,54.0,0.99700,3.26,0.65,9.8,5,7.84
3,11.2,0.280,0.56,1.9,0.075,17.0,60.0,0.99800,3.16,0.58,9.8,6,11.76
4,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5,7.40
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1594,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5,6.28
1595,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,6,6.00
1596,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6,6.43
1597,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5,6.02
1598,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6,6.47

### lambda 보다 더 복잡한 함수 적용

In [80]:
def custom(alcohol , ph) :
    if alcohol < 10 :
        return ph * 1.5
    else :
        return ph * -1

df["New_pH"] = df.apply(lambda x : custom(x["alcohol"], x["pH"]) , axis = 1 )
df

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality,New_val,New_pH
0,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5,7.40,5.265
1,7.8,0.880,0.00,2.6,0.098,25.0,67.0,0.99680,3.20,0.68,9.8,5,7.80,4.800
2,7.8,0.760,0.04,2.3,0.092,15.0,54.0,0.99700,3.26,0.65,9.8,5,7.84,4.890
3,11.2,0.280,0.56,1.9,0.075,17.0,60.0,0.99800,3.16,0.58,9.8,6,11.76,4.740
4,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5,7.40,5.265
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1594,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5,6.28,-3.450
1595,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,6,6.00,-3.520
1596,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6,6.43,-3.420
1597,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5,6.02,-3.570
1598,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6,6.47,-3.390

In [81]:
import sqlite3
con = sqlite3.connect('emaildb.sqlite')
cur = con.cursor()

In [82]:
df = pd.read_sql('select * from Counts', con=con)
df

                            email  count
0      stephen.marquard@uct.ac.za      2
1        louis@media.berkeley.edu      3
2                 zqian@umich.edu      4
3                rjlowe@iupui.edu      2
4                  cwen@iupui.edu      5
5               gsilver@umich.edu      3
6              wagnermr@iupui.edu      1
7        antranig@caret.cam.ac.uk      1
8   gopal.ramasammycook@gmail.com      1
9         david.horwitz@uct.ac.za      4
10         ray@media.berkeley.edu      1

In [83]:
df = pd.read_sql('SELECT email, count FROM Counts ORDER BY count DESC LIMIT 10', con=con)
df

                           email  count
0                 cwen@iupui.edu      5
1                zqian@umich.edu      4
2        david.horwitz@uct.ac.za      4
3       louis@media.berkeley.edu      3
4              gsilver@umich.edu      3
5     stephen.marquard@uct.ac.za      2
6               rjlowe@iupui.edu      2
7             wagnermr@iupui.edu      1
8       antranig@caret.cam.ac.uk      1
9  gopal.ramasammycook@gmail.com      1

## Merging DataFrame

In [84]:
df = pd.DataFrame([{"name": "Chris", "Item Purchased": "Sponge", "Cost": 22.50},
                               {"name": "Kevin", "Item Purchased": "Kettle", "Cost": 2.50},
                               {"name": "Filip", "Item Purchased": "Spoon", "Cost": 5.00}],
                             index=['Store 1', 'Store 1', 'Store 2'])
df

          name Item Purchased  Cost
Store 1  Chris         Sponge  22.5
Store 1  Kevin         Kettle   2.5
Store 2  Filip          Spoon   5.0

- 새로운 column 추가

In [85]:
df['Date'] = ['December 1', 'January 1', 'mid-May']
df

          name Item Purchased  Cost        Date
Store 1  Chris         Sponge  22.5  December 1
Store 1  Kevin         Kettle   2.5   January 1
Store 2  Filip          Spoon   5.0     mid-May

- broadcasting

In [86]:
df['Delivered'] = True
df

          name Item Purchased  Cost        Date  Delivered
Store 1  Chris         Sponge  22.5  December 1       True
Store 1  Kevin         Kettle   2.5   January 1       True
Store 2  Filip          Spoon   5.0     mid-May       True

- missing value 추가

In [87]:
df['Feedback'] = ['Positive', None, 'Negarive']
df

          name Item Purchased  Cost        Date  Delivered  Feedback
Store 1  Chris         Sponge  22.5  December 1       True  Positive
Store 1  Kevin         Kettle   2.5   January 1       True      None
Store 2  Filip          Spoon   5.0     mid-May       True  Negarive

- reset index

In [88]:
adf = df.reset_index()
adf

     index   name Item Purchased  Cost        Date  Delivered  Feedback
0  Store 1  Chris         Sponge  22.5  December 1       True  Positive
1  Store 1  Kevin         Kettle   2.5   January 1       True      None
2  Store 2  Filip          Spoon   5.0     mid-May       True  Negarive

- 특정 row 전체의 data update $\rightarrow$ 지정 안된 row  는 missing value 처리

In [89]:
adf['Date'] = pd.Series({0: 'December 10', 2: 'mid-June'})
adf

     index   name Item Purchased  Cost         Date  Delivered  Feedback
0  Store 1  Chris         Sponge  22.5  December 10       True  Positive
1  Store 1  Kevin         Kettle   2.5          NaN       True      None
2  Store 2  Filip          Spoon   5.0     mid-June       True  Negarive

## DataFrame 간의 Join

<img src="venDiagram.png" width=400>
<p> Inner Join (Intersection) </p>
<img src="innerJoin.png" width=300>

In [90]:
staff_df = pd.DataFrame([{"Name": 'Kelly', "Role": 'HR Director'},
                                      {"Name": "Sally", "Role": 'Coordinator'},
                                      {"Name": "James", "Role": "Grader"}])
staff_df = staff_df.set_index("Name")

staff_df

              Role
Name
Kelly  HR Director
Sally  Coordinator
James       Grader

In [91]:
student_df = pd.DataFrame([{"Name": 'James', "Major": 'Business'},
                                      {"Name": "Sally", "Major": 'AI'},
                                      {"Name": "Mike", "Major": "Engineering"}])
student_df = student_df.set_index("Name")
student_df

             Major
Name
James     Business
Sally           AI
Mike   Engineering

### outer join

In [92]:
pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

              Role        Major
Name
James       Grader     Business
Kelly  HR Director          NaN
Mike           NaN  Engineering
Sally  Coordinator           AI

### inner join (default)

In [93]:
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

              Role     Major
Name
Sally  Coordinator        AI
James       Grader  Business

### left join $\rightarrow$ SQL 의 left outer join 과 유사

In [94]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

              Role     Major
Name
Kelly  HR Director       NaN
Sally  Coordinator        AI
James       Grader  Business

### right join $\rightarrow$ SQL 의 right outer join 과 유사

In [95]:
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

              Role        Major
Name
James       Grader     Business
Sally  Coordinator           AI
Mike           NaN  Engineering

### index 가 단순 sequence 일 경우 join 할 column 지정

In [96]:
staff_df = staff_df.reset_index()
staff_df

    Name         Role
0  Kelly  HR Director
1  Sally  Coordinator
2  James       Grader

In [97]:
student_df = student_df.reset_index()
student_df

    Name        Major
0  James     Business
1  Sally           AI
2   Mike  Engineering

In [98]:
pd.merge(staff_df, student_df, left_on='Name', right_on='Name')

    Name         Role     Major
0  Sally  Coordinator        AI
1  James       Grader  Business

### 중복된 column 명이 있을 경우 자동으로 suffix 부여

In [99]:
staff_df['Location'] = ['Korea', 'China', 'Europe']
staff_df

    Name         Role Location
0  Kelly  HR Director    Korea
1  Sally  Coordinator    China
2  James       Grader   Europe

In [100]:
student_df['Location'] = ['Seoul', 'Pusan', 'Jeju']
student_df

    Name        Major Location
0  James     Business    Seoul
1  Sally           AI    Pusan
2   Mike  Engineering     Jeju

- left : `_x`, right: `_y`

In [101]:
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

    Name         Role Location_x     Major Location_y
0  Kelly  HR Director      Korea       NaN        NaN
1  Sally  Coordinator      China        AI      Pusan
2  James       Grader     Europe  Business      Seoul

## 연습문제

### product DataFrame

| productID | Price | Product | 
|:---:|:---:|:---:|
| 4109| 5.0 | Sushi Roll | 
| 1412 | 0.5 | Egg |
| 8931 | 1.5 | Bagel |

### invoice DataFrame
<table>
    <th></th>
    <th>Customer</th>
    <th>ProductId</th>
    <th>Quantity</th>
    <tr>
    <td>0</td>
     <td>ALL</td>
     <td>4109</td>
     <td>1</td>
    </tr>
    <tr>
    <td>1</td>
    <td>Eric</td>
     <td>1412</td>
     <td>12</td>
     </tr>
    <tr>
     <td>2</td>
    <td>Ande</td>
     <td>8931</td>
     <td>6</td>
     </tr>
    <tr>
    <td>3</td>
    <td>Sam</td>
    <td>4109</td>   
    <td>2</td>
    </tr>
</table>

### 연습 문제 

- 두개의 DataFrame 을 생성하고 하나의 DataFrame 으로 join

In [ ]:
answer_df = pd.merge(# Code Here )

```
  Customer  ProductID  Quantity  Price     Product
0      Ali          4109         1          5.0    Sushi Roll
3      Sam       4109         2          5.0    Sushi Roll
1     Eric         1412        12         0.5         Egg
2     Ande       8931         6          1.5       Bagel
```

## method chaining

In [103]:
df = pd.read_csv('winequality-red.csv', sep=';')
df.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [104]:
df['quality'].unique()

array([5, 6, 7, 4, 8, 3], dtype=int64)

In [105]:
(df.where(df['quality'] == 3)
        .dropna()
        .reset_index()
        .rename(columns={'fixed acidity': 'acid', 'quality': 'target'})
        .loc[:, ['acid', 'target']])

   acid  target
0  11.6     3.0
1  10.4     3.0
2   7.4     3.0
3  10.4     3.0
4   8.3     3.0
5   7.6     3.0
6   6.8     3.0
7   7.3     3.0
8   7.1     3.0
9   6.7     3.0

### Group by

In [106]:
for quality in sorted(df['quality'].unique()):
    avg = np.mean(df.where(df['quality'] == quality).dropna()['fixed acidity'])
    print(f"quality {quality} 의 평균 fixed acidity 는 {avg:.2f}")

quality 3 의 평균 fixed acidity 는 8.36
quality 4 의 평균 fixed acidity 는 7.78
quality 5 의 평균 fixed acidity 는 8.17
quality 6 의 평균 fixed acidity 는 8.35
quality 7 의 평균 fixed acidity 는 8.87
quality 8 의 평균 fixed acidity 는 8.57

- group by 사용

In [107]:
for group, frame in df.groupby('quality'):
    avg = np.mean(frame['fixed acidity'])
    print(f"quality {group} 의 평균 fixed acidity 는 {avg:.2f}")

quality 3 의 평균 fixed acidity 는 8.36
quality 4 의 평균 fixed acidity 는 7.78
quality 5 의 평균 fixed acidity 는 8.17
quality 6 의 평균 fixed acidity 는 8.35
quality 7 의 평균 fixed acidity 는 8.87
quality 8 의 평균 fixed acidity 는 8.57

- aggregate

In [108]:
df.groupby('quality').agg({'fixed acidity': np.mean})

         fixed acidity
quality
3             8.360000
4             7.779245
5             8.167254
6             8.347179
7             8.872362
8             8.566667

## Scales

### Categorical
- Nominal Variable (명목 변수)

In [109]:
df = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D'],
                             index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok', 'ok', 'ok', 'poor'])
df.rename(columns={0: 'Grades'}, inplace=True)
df

          Grades
excellent     A+
excellent      A
excellent     A-
good          B+
good           B
good          B-
ok            C+
ok             C
ok            C-
poor           D

### 순서가 있는 Category Data type

- number 로 encoding 않아도data 자체에서 category 의 순서 기억

In [110]:
df['Grades'] = pd.Categorical(df['Grades'], categories=['D', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+'], ordered=True)

In [111]:
df.Grades

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
good         B-
ok           C+
ok            C
ok           C-
poor          D
Name: Grades, dtype: category
Categories (10, object): [D < C- < C < C+ ... B+ < A- < A < A+]

In [112]:
df.Grades > 'C'

excellent     True
excellent     True
excellent     True
good          True
good          True
good          True
ok            True
ok           False
ok           False
poor         False
Name: Grades, dtype: bool

### binning

In [113]:
s = pd.Series([168, 180, 174, 190, 170, 185, 179, 181, 175, 160, 182, 177, 180, 171])

pd.cut(s, 3)

0     (159.97, 170.0]
1      (170.0, 180.0]
2      (170.0, 180.0]
3      (180.0, 190.0]
4     (159.97, 170.0]
5      (180.0, 190.0]
6      (170.0, 180.0]
7      (180.0, 190.0]
8      (170.0, 180.0]
9     (159.97, 170.0]
10     (180.0, 190.0]
11     (170.0, 180.0]
12     (170.0, 180.0]
13     (170.0, 180.0]
dtype: category
Categories (3, interval[float64]): [(159.97, 170.0] < (170.0, 180.0] < (180.0, 190.0]]

In [114]:
pd.cut(s, 3, labels=['Small', 'Medium', 'Large'])

0      Small
1     Medium
2     Medium
3      Large
4      Small
5      Large
6     Medium
7      Large
8     Medium
9      Small
10     Large
11    Medium
12    Medium
13    Medium
dtype: category
Categories (3, object): [Small < Medium < Large]

### Pivot Tabels

- 여러 데이터 중에서 자신이 원하는 데이터만을 가지고 원하는 행과 열에 데이터를 배치하여 새로운 보고서를 만드는 기능  

- SQL 의 query 기능과 유사

In [115]:
df = pd.read_csv("cars.csv")
df.head()

,YEAR,Make,Model,Size,(kW),Unnamed: 5,TYPE,CITY (kWh/100 km),HWY (kWh/100 km),COMB (kWh/100 km),CITY (Le/100 km),HWY (Le/100 km),COMB (Le/100 km),(g/km),RATING,(km),TIME (h)
0,2012,MITSUBISHI,i-MiEV,SUBCOMPACT,49,A1,B,16.9,21.4,18.7,1.9,2.4,2.1,0,NaN,100,7
1,2012,NISSAN,LEAF,MID-SIZE,80,A1,B,19.3,23.0,21.1,2.2,2.6,2.4,0,NaN,117,7
2,2013,FORD,FOCUS ELECTRIC,COMPACT,107,A1,B,19.0,21.1,20.0,2.1,2.4,2.2,0,NaN,122,4
3,2013,MITSUBISHI,i-MiEV,SUBCOMPACT,49,A1,B,16.9,21.4,18.7,1.9,2.4,2.1,0,NaN,100,7
4,2013,NISSAN,LEAF,MID-SIZE,80,A1,B,19.3,23.0,21.1,2.2,2.6,2.4,0,NaN,117,7

- 위의 원본 data 에서 `YEAR`, `Make` 두 가지만으로  연도별 `Make` 별 평균값의 새로운 table 생성

In [116]:
df.pivot_table(values='(kW)', index='YEAR', columns='Make', aggfunc=np.mean)

Make    BMW  CHEVROLET   FORD   KIA  MITSUBISHI  NISSAN  SMART       TESLA
YEAR
2012    NaN        NaN    NaN   NaN        49.0    80.0    NaN         NaN
2013    NaN        NaN  107.0   NaN        49.0    80.0   35.0  280.000000
2014    NaN      104.0  107.0   NaN        49.0    80.0   35.0  268.333333
2015  125.0      104.0  107.0  81.0        49.0    80.0   35.0  320.666667
2016  125.0      104.0  107.0  81.0        49.0    80.0   35.0  409.700000

In [117]:
df.pivot_table(values='(kW)', index='YEAR', columns='Make', aggfunc=[np.mean, np.min])

       mean                                                              amin  \
Make    BMW CHEVROLET   FORD   KIA MITSUBISHI NISSAN SMART       TESLA    BMW
YEAR
2012    NaN       NaN    NaN   NaN       49.0   80.0   NaN         NaN    NaN
2013    NaN       NaN  107.0   NaN       49.0   80.0  35.0  280.000000    NaN
2014    NaN     104.0  107.0   NaN       49.0   80.0  35.0  268.333333    NaN
2015  125.0     104.0  107.0  81.0       49.0   80.0  35.0  320.666667  125.0
2016  125.0     104.0  107.0  81.0       49.0   80.0  35.0  409.700000  125.0


Make CHEVROLET   FORD   KIA MITSUBISHI NISSAN SMART  TESLA
YEAR
2012       NaN    NaN   NaN       49.0   80.0   NaN    NaN
2013       NaN  107.0   NaN       49.0   80.0  35.0  270.0
2014     104.0  107.0   NaN       49.0   80.0  35.0  225.0
2015     104.0  107.0  81.0       49.0   80.0  35.0  280.0
2016     104.0  107.0  81.0       49.0   80.0  35.0  283.0

- aggfunc 별 subtotal 추가

In [118]:
df.pivot_table(values='(kW)', index='YEAR', columns='Make', aggfunc=[np.mean, np.min], margins=True)

       mean                                                             \
Make    BMW CHEVROLET   FORD   KIA MITSUBISHI NISSAN SMART       TESLA
YEAR
2012    NaN       NaN    NaN   NaN       49.0   80.0   NaN         NaN
2013    NaN       NaN  107.0   NaN       49.0   80.0  35.0  280.000000
2014    NaN     104.0  107.0   NaN       49.0   80.0  35.0  268.333333
2015  125.0     104.0  107.0  81.0       49.0   80.0  35.0  320.666667
2016  125.0     104.0  107.0  81.0       49.0   80.0  35.0  409.700000
All   125.0     104.0  107.0  81.0       49.0   80.0  35.0  345.478261

                   amin                                                        \
Make         All    BMW CHEVROLET   FORD   KIA MITSUBISHI NISSAN SMART  TESLA
YEAR
2012   64.500000    NaN       NaN    NaN   NaN       49.0   80.0   NaN    NaN
2013  158.444444    NaN       NaN  107.0   NaN       49.0   80.0  35.0  270.0
2014  135.000000    NaN     104.0  107.0   NaN       49.0   80.0  35.0  225.0
2015  181.428571  125.0     104.0  107.0  81.0       49.0   80.0  35.0  280.0
2016  252.263158  125.0     104.0  107.0  81.0       49.0   80.0  35.0  283.0
All   190.622642  125.0     104.0  107.0  81.0       49.0   80.0  35.0  225.0


Make All
YEAR
2012  49
2013  35
2014  35
2015  35
2016  35
All   35

- `Make` + `Model` 별 pivot table

In [119]:
df.pivot_table(values='(kW)', index='YEAR', columns=['Make', 'Model'], aggfunc=[np.mean, np.min], margins=True)

        mean                                                     \
Make     BMW CHEVROLET           FORD     KIA MITSUBISHI NISSAN
Model     i3  SPARK EV FOCUS ELECTRIC SOUL EV     i-MiEV   LEAF
YEAR
2012     NaN       NaN            NaN     NaN       49.0   80.0
2013     NaN       NaN          107.0     NaN       49.0   80.0
2014     NaN     104.0          107.0     NaN       49.0   80.0
2015   125.0     104.0          107.0    81.0       49.0   80.0
2016   125.0     104.0          107.0    81.0       49.0    NaN
All    125.0     104.0          107.0    81.0       49.0   80.0

                                                   \
Make
Model LEAF (24 kWh battery) LEAF (30 kWh battery)
YEAR
2012                    NaN                   NaN
2013                    NaN                   NaN
2014                    NaN                   NaN
2015                    NaN                   NaN
2016                   80.0                  80.0
All                    80.0                  80.0

                                                                   ...  \
Make                            SMART                              ...
Model FORTWO ELECTRIC DRIVE CABRIOLET FORTWO ELECTRIC DRIVE COUPE  ...
YEAR                                                               ...
2012                              NaN                         NaN  ...
2013                             35.0                        35.0  ...
2014                             35.0                        35.0  ...
2015                             35.0                        35.0  ...
2016                             35.0                        35.0  ...
All                              35.0                        35.0  ...

                             amin                              \
Make                        TESLA
Model MODEL S (85/90 kWh battery) MODEL S 70D MODEL S 85D/90D
YEAR
2012                          NaN         NaN             NaN
2013                          NaN         NaN             NaN
2014                          NaN         NaN             NaN
2015                        283.0       280.0           280.0
2016                        283.0       386.0           386.0
All                         283.0       280.0           280.0

                                                                      \
Make
Model MODEL S 90D (Refresh) MODEL S P85D/P90D MODEL S P90D (Refresh)
YEAR
2012                    NaN               NaN                    NaN
2013                    NaN               NaN                    NaN
2014                    NaN               NaN                    NaN
2015                    NaN             515.0                    NaN
2016                  386.0             568.0                  568.0
All                   386.0             515.0                  568.0


Make                                               All
Model MODEL S PERFORMANCE MODEL X 90D MODEL X P90D
YEAR
2012                  NaN         NaN          NaN  49
2013                310.0         NaN          NaN  35
2014                310.0         NaN          NaN  35
2015                  NaN         NaN          NaN  35
2016                  NaN       386.0        568.0  35
All                 310.0       386.0        568.0  35

[6 rows x 48 columns]

### Date 처리 기능

### Timestamp

- Python 의 datetime 과 대부분의 겨우 호환  

- DatetimeIndex 로 사용

In [120]:
pd.Timestamp('10/12/2020 10:30PM')

Timestamp('2020-10-12 22:30:00')

In [121]:
pd.Timestamp('2020-10-12 10:30PM')

Timestamp('2020-10-12 22:30:00')

In [122]:
import datetime

datetime.datetime(2020, 10, 12, 22, 30)

datetime.datetime(2020, 10, 12, 22, 30)

### DatetimeIndex

In [123]:
ts1 = pd.Series(list('abc'), [pd.Timestamp('2020-09-01'), pd.Timestamp('2020-09-02'), pd.Timestamp('2020-09-03')])
ts1

2020-09-01    a
2020-09-02    b
2020-09-03    c
dtype: object

In [124]:
type(ts1.index)

pandas.core.indexes.datetimes.DatetimeIndex

### Datetime format 으로 convert

In [125]:
d1 = ['2 June 2013', 'Aug 29, 2020', '2018-06-30', '7/12/2017']

ts2 = pd.DataFrame(np.random.randint(10, 100, (4, 2)), index=d1, columns=list('ab'))
ts2

               a   b
2 June 2013   17  20
Aug 29, 2020  62  66
2018-06-30    48  83
7/12/2017     62  28

In [126]:
ts2.index = pd.to_datetime(ts2.index)
ts2

             a   b
2013-06-02  17  20
2020-08-29  62  66
2018-06-30  48  83
2017-07-12  62  28

### Timedelta

- difference of time

In [127]:
pd.Timestamp('2020-10-02') - pd.Timestamp('2020-09-30')

Timedelta('2 days 00:00:00')

In [128]:
pd.Timestamp('2020-10-02 8:10AM') + pd.Timedelta('30d 10h')

Timestamp('2020-11-01 18:10:00')